import streamlit as st 

#ส่วนที่ 1 หัวข้อหน้าเว็บ (Title สีแดง)
st.markdown(" :red[🏋️ คำนวณค่าดัชนีมวลกาย BMI]")
st.write("กรองข้อมูลน้ำหนักและส่วนสูงของคุณ เพื่อเช็กสุขภาพเบื้องต้น")

#ส่วนที่ 2 สร้างช่องรับค่าน้ำหนัก และ ส่วนสูง
weight = st.numder_input("กรองน้ำหนักของคุณ (กิโลกรัม):", min_value=1.0, value=1.0)
height_cm = st.numder_input("กรองส่วนสูงของคุณ (เซนติเมตร):", min_value=1.0, value=1.0)


#ส่วนที่ 3 สร้างปุ่มกดคำนวณ
if st.button("คำนวณค่า BMI 🎯"):
    # แปลงส่วนสูงจาก cm เป็น เมตร แล้วคำนวณ BMI
    height_m = h
  .
